[
  {
    "userName": "John D.",
    "rating": 5,
    "review": "Fantastic service! My car looked brand new after the wash. The staff were very professional, and the booking process was seamless.",
    "date": "2024-09-20"
  },
  {
    "userName": "Sarah P.",
    "rating": 4,
    "review": "Great experience overall. The interface is user-friendly, and the available slots were easy to pick. Could have more slot availability though.",
    "date": "2024-09-19"
  },
  {
    "userName": "Michael B.",
    "rating": 5,
    "review": "The best car wash in town! Booking was super easy, and I loved the reminder notifications before my slot.",
    "date": "2024-09-18"
  },
  {
    "userName": "Jessica T.",
    "rating": 4,
    "review": "Efficient and quick service. The only thing I would suggest is adding more detailed descriptions for each service.",
    "date": "2024-09-17"
  },
  {
    "userName": "Alex R.",
    "rating": 5,
    "review": "Superb! My car looks spotless. The website’s design is sleek, and booking a time slot was effortless. Definitely recommend!",
    "date": "2024-09-16"
  },
  {
    "userName": "Emma G.",
    "rating": 4,
    "review": "Very satisfied! The countdown feature is great, but I wish there were more filter options to sort services.",
    "date": "2024-09-15"
  },
  {
    "userName": "David L.",
    "rating": 5,
    "review": "Excellent! Loved how easy it was to compare services. The team did an amazing job cleaning my SUV.",
    "date": "2024-09-14"
  },
  {
    "userName": "Sophia W.",
    "rating": 3,
    "review": "Service was good, but I had some trouble with the payment gateway. It took longer than expected.",
    "date": "2024-09-13"
  },
  {
    "userName": "Chris M.",
    "rating": 5,
    "review": "Perfect! The service was top-notch, and the interface made it so simple to book my slot. I’ll definitely be using this again.",
    "date": "2024-09-12"
  },
  {
    "userName": "Olivia K.",
    "rating": 4,
    "review": "Great car wash service! The only improvement I would suggest is adding more time slots for busy weekends.",
    "date": "2024-09-11"
  }
]
